W7D2/music_app_user/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "wayne"], ["LIMIT", 1]]
---
  def self.validate_user_credentials(username, password)
    user = User.find_by(username: username)