W10D5/todoRails/todos/app/controllers/api/todos_controller.rb

    def create
    todo = Todo.new(todo_params)
        if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "123"], ["body", "123"], ["done", false], ["created_at", "2020-04-20 05:37:27.637011"], ["updated_at", "2020-04-20 05:37:27.637011"]]