W6D3/art_share_api/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "mike"], ["password", "12345"], ["created_at", "2020-03-19 22:03:04.938519"], ["updated_at", "2020-03-19 22:03:04.938519"]]
---
  def create
    user = User.new(user_params)
    if user.save