W6D4/art_share_api/app/controllers/artwork_shares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
      artwork_share = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 1], ["created_at", "2020-03-20 17:21:47.375448"], ["updated_at", "2020-03-20 17:21:47.375448"]]
---
    def create
      shared = ArtworkShare.create(artwork_share_params)