W6D4/art_share_api/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artist_id = NULL OR viewer_id = NULL)
---
  def index
    debugger
    artworks = Artwork #left_outer_join is correct
    .joins(:shared_artworks)
    .where('artist_id = ? OR viewer_id = ?', params[:user_id], params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "artist_id" = $3, "updated_at" = $4 WHERE "artworks"."id" = $5  [["title", "mastapiece123"], ["image_url", "345.com"], ["artist_id", 2], ["updated_at", "2020-03-20 16:55:28.441052"], ["id", 1]]
---
  def update
    artwork = Artwork.find(params[:id])

    if artwork.update(artwork_params)