W6D4/art_share_api/app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Spam spam spam"], ["author_id", 1], ["artwork_id", 3], ["created_at", "2020-03-20 21:09:56.488182"], ["updated_at", "2020-03-20 21:09:56.488182"]]
---
  def create
    comment = Comment.new(new_comment_params)

    if comment.save