W6D4/art_share_api/app/controllers/likes_controller.rb

  def index
    # user = User.find(params[:user_id])

    # if params[:type] == 'Comment'
    #   render json: user.liked_comments
    # elsif params[:type] == 'Artwork'
    #   render json: user.liked_artworks
    # else
    #   render string: 'must give a type of Comment or Artwork'
    # end

    if params[:type] == 'Comment'
      likes = Comment
        .joins(:likers)
        .where('liked_item_type = ? AND user_id = ?', 'Comment', params[:user_id])
    elsif params[:type] == 'Artwork'
      likes = Artwork
        .joins(:likers)
        .where('liked_item_type = ? AND user_id = ?', 'Artwork', params[:user_id])
---
SELECT "comments".* FROM "comments" INNER JOIN "likes" ON "comments"."id" = "likes"."liked_item_id" WHERE "likes"."user_id" = $1 AND "likes"."liked_item_type" = $2  [["user_id", 1], ["liked_item_type", "Comment"]]
SELECT "artworks".* FROM "artworks" INNER JOIN "likes" ON "artworks"."id" = "likes"."liked_item_id" WHERE "likes"."user_id" = $1 AND "likes"."liked_item_type" = $2  [["user_id", 1], ["liked_item_type", "Artwork"]]
SELECT "comments".* FROM "comments" INNER JOIN "likes" ON "likes"."liked_item_id" = "comments"."id" AND "likes"."liked_item_type" = $1 INNER JOIN "users" ON "users"."id" = "likes"."user_id" WHERE (liked_item_type = 'Comment' AND user_id = '3')  [["liked_item_type", "Comment"]]

  def create
    # debugger
    like = Like.new(like_params)

    if like.save
---
INSERT INTO "likes" ("user_id", "liked_item_id", "liked_item_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["liked_item_id", 2], ["liked_item_type", "Comment"], ["created_at", "2020-03-20 23:39:00.049155"], ["updated_at", "2020-03-20 23:39:00.049155"]]

  def destroy
    like = Like.find(params[:id])
    like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 8]]