W6D4/art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%'way'%')
---
  def index
    if params[:username]
      # debugger
      # bootleg = "%#{params[:username]}%"
      users = User.where('username ~* ?', params[:username])
    else
      users = User.all

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "TA vanessa"], ["created_at", "2020-03-20 19:07:59.049291"], ["updated_at", "2020-03-20 19:07:59.049291"]]
---
  def create
    user = User.new(user_params)
    # debugger
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "TA vanessa"], ["password", "abcdef"], ["updated_at", "2020-03-19 22:23:15.988198"], ["id", 5]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)