W6D3/first_routes/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "mike"], ["password", "12345"], ["created_at", "2020-03-19 22:03:04.938519"], ["updated_at", "2020-03-19 22:03:04.938519"]]

  def update
    user = User.find(params[:id])

    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "TA vanessa"], ["password", "abcdef"], ["updated_at", "2020-03-19 22:23:15.988198"], ["id", 5]]