W6D5/ninety_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "grey"], ["updated_at", "2020-03-23 23:44:06.993703"], ["id", 1]]
---
    def update
        @cat = Cat.find_by(id: params[:id])
        if @cat.update(cat_params)