W11D4/benchbnb/app/controllers/api/benches_controller.rb

SELECT "benches".* FROM "benches" WHERE (lat BETWEEN '37.74187133792972' AND '37.809713098290686') AND (lng BETWEEN '-122.47791534423827' AND '-122.3920846557617')
---
  def index
    @benches = Bench.all